trade_exp/src/Documents/НехваткаТовара/НехваткаТовара.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="c8311102-2bb4-436b-bb12-66a8da975638">
  <name>НехваткаТовара</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="a6a14f4b-e501-4d3c-b989-b47e39a06b3f">
    <name>Контрагент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="b3348314-21e1-40ff-be74-2f524dcfabb1">
    <name>Менеджер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="1880af22-1fb4-494f-82e9-1c5c55396c16">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="3136c8ee-21fb-4db2-aa89-8fa81fbbc89c">
    <name>Клиент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="c93b9b15-5986-4cd3-a754-807c83cdbe32">
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="2a14ac7a-5fb6-49a8-a040-bf2f5c3ba3b1">
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="052f89b3-e0c0-4be4-b42b-c2c96f9bab55">
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="e3b559db-d993-4540-ba27-0b752c9cde67">
      <name>БылоНужно</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="14e07e05-addc-41ea-a48d-45abc58c45f4">
      <name>Остаток</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="bdeb5405-6cf8-4efb-b529-169c232cf7d0">
      <name>Нехватка</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="ec59bc91-ae13-458b-93ed-ffb0dc5f1e1f">
      <name>КлассТовара</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="7344d98b-2a78-4b12-a240-f54c32ce62f7">
      <name>Ликвидность</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="4bd83840-ee98-485c-ae3a-4a20564e386d">
      <name>ОповещенПоEmail</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <dateQualifiers>
            <dateFractions>Date</dateFractions>
          </dateQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
</mdclass:Document>

trade_exp/src/Documents/НехваткаТовара/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
Процедура СоздатьСообщениеВБитрихПоДокументуНехватки(ДокументНехватки) экспорт
		
	Текст = "Нехватка товара " + СОКРЛП(ДокументНехватки.Номер) + " от " + СокрЛП(ДокументНехватки.Дата) + Символы.ПС + Строка(ДокументНехватки.Клиент) + ";" + Символы.ПС;
	ТекстДляЖивойЛенты = "";
	
	Для Каждого Стр Из ДокументНехватки.Товары Цикл
		Менеджер = Стр.Номенклатура.МенеджерПоставок;
		Пользователь = Справочники.Пользователи.НайтиПоНаименованию(Менеджер, Истина);
		ТекстНоменклатуры = "" + Стр.Номенклатура + ", " + Стр.КлассТовара + ", " + Стр.Ликвидность + ", Нужно - " + Стр.БылоНужно + ", Остаток - " + Стр.Остаток + ", Нехватка - " + Стр.Нехватка + ", " + Менеджер + Символы.ПС;
		ТекстСообщенияМенеджеру = Текст + ТекстНоменклатуры;
		Если Пользователь <> Справочники.Пользователи.ПустаяСсылка() Тогда
			АльтерраВзаимодействиеСБитрикс24.ОтправитьСообщениеВБитрикс(ТекстСообщенияМенеджеру, Пользователь);
		КонецЕсли;
		ТекстДляЖивойЛенты = ?(ТекстДляЖивойЛенты = "", ТекстСообщенияМенеджеру, ТекстДляЖивойЛенты + ТекстНоменклатуры);
	КонецЦикла;	  

	Результат = АльтерраВзаимодействиеСБитрикс24.СообщениеВЖивуюЛенту(
		"Нехватка" + Формат(ДокументНехватки.Дата, "ДФ=""ММММ""") + Формат(ДокументНехватки.Дата, "ДФ=""гггг""") + ", " + ДокументНехватки.Склад, 
		СтрЗаменить(ТекстДляЖивойЛенты, "&", ""), 
		, 
		"Группа 'Коммерческие вопросы'");
		
	Если ЗначениеЗаполнено(Результат) Тогда
		ЗаписьЖурналаРегистрации("Публикация информации о нехватке", УровеньЖурналаРегистрации.Ошибка, , , Результат);		
		Сообщить("Отправка сообщения в группу не удалась, попробуйте отправить вручную из документа Нехватки.");
	КонецЕсли;

КонецПроцедуры
	
	
#КонецЕсли
